In [1]:
import pandas as pd

In [3]:
path = 'DATA.csv'

In [5]:
path

'DATA.csv'

In [7]:
df=pd.read_csv(path, encoding = 'cp949')

In [11]:
df.head(3)

      학번   이름   국어  수학    영어    과학
0  30202  1유현  100  80  55.0  55.0
1  30203  2유현   95  78   NaN   NaN
2  30204  3유현   90  76   NaN   NaN

In [58]:
null_count=df.isnull().sum()

In [59]:
null_count

학번    0
이름    0
국어    0
수학    0
영어    6
과학    5
dtype: int64

In [60]:
df_null_count= null_count.reset_index()

In [61]:
df_null_count

  index  0
0    학번  0
1    이름  0
2    국어  0
3    수학  0
4    영어  6
5    과학  5

In [62]:
df_null_count.columns=['메뉴','결측값']

In [63]:
df_null_count.columns= ['메뉴','결측값']

In [64]:
df_null_count

   메뉴  결측값
0  학번    0
1  이름    0
2  국어    0
3  수학    0
4  영어    6
5  과학    5

In [65]:
df_null_count.tail(2)

   메뉴  결측값
4  영어    6
5  과학    5

In [66]:
df_2=df_null_count.tail(2)
df_2

   메뉴  결측값
4  영어    6
5  과학    5

In [67]:
drop_columns = df_2['메뉴']

In [68]:
drop_columns

4    영어
5    과학
Name: 메뉴, dtype: object

In [69]:
df.shape

(9, 6)

In [70]:
df_5=df.drop(drop_columns,axis=1)

In [72]:
df_5

      학번   이름   국어  수학
0  30202  1유현  100  80
1  30203  2유현   95  78
2  30204  3유현   90  76
3  30205  4유현   85  74
4  30206  5유현   80  72
5  30207  6유현   75  70
6  30208  7유현   70  68
7  30209  8유현   65  66
8  30210  9유현   60  64

In [73]:
df_5.shape

(9, 4)